[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        faces;
-        this._distribution = new Map<number,number>;
-        if(faces >= 2)
-        {
-            this._faces = faces;
-        }
-        else
-        {
-            this._faces = 6;
-        }
-        for (let i = 1; i <= faces; i++) {
-            this._distribution.set(i,0);
-        }
-        this._last = 0;
-    }
+    constructor(faces: number) {}
 
     getFaces(): number{
killedBy: Roller Tests Inititalize the class object with valid number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:12:12
     constructor(faces: number) {
         faces;
         this._distribution = new Map<number,number>;
-        if(faces >= 2)
+        if(false)
         {
             this._faces = faces;
killedBy: Roller Tests Inititalize the class object with valid number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] EqualityOperator
src/Roller.ts:12:12
     constructor(faces: number) {
         faces;
         this._distribution = new Map<number,number>;
-        if(faces >= 2)
+        if(faces < 2)
         {
             this._faces = faces;
killedBy: Roller Tests Inititalize the class object with valid number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] BlockStatement
src/Roller.ts:13:9
         faces;
         this._distribution = new Map<number,number>;
         if(faces >= 2)
-        {
-            this._faces = faces;
-        }
+        {}
         else
         {
killedBy: Roller Tests Inititalize the class object with valid number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] BlockStatement
src/Roller.ts:17:9
             this._faces = faces;
         }
         else
-        {
-            this._faces = 6;
-        }
+        {}
         for (let i = 1; i <= faces; i++) {
             this._distribution.set(i,0);
killedBy: Roller Tests Inititalize the class object with invalid number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:20:42
         {
             this._faces = 6;
         }
-        for (let i = 1; i <= faces; i++) {
-            this._distribution.set(i,0);
-        }
+        for (let i = 1; i <= faces; i++) {}
         this._last = 0;
     }
killedBy: Roller Tests Distribution test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] EqualityOperator
src/Roller.ts:20:25
         {
             this._faces = 6;
         }
-        for (let i = 1; i <= faces; i++) {
+        for (let i = 1; i > faces; i++) {
             this._distribution.set(i,0);
         }
killedBy: Roller Tests Distribution test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] BlockStatement
src/Roller.ts:26:23
         this._last = 0;
     }
 
-    getFaces(): number{
-        return this._faces;
-    }
+    getFaces(): number{}
     
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller Tests Inititalize the class object with valid number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] BlockStatement
src/Roller.ts:40:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if(!(value >= 1 && value <= this._faces))
-        {
-            return 0;
-        }
-        else
-        {
-            this._last = value;
-            this._distribution.set(value,this._distribution.get(value)+1)
-        }
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller Tests Roll Test: The roll function should return 0 if a wrong value is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:41:28
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if(!(value >= 1 && value <= this._faces))
+        if(!(value >= 1 && value > this._faces))
         {
             return 0;
killedBy: Roller Tests Roll Test: The roll function should return 0 if a wrong value is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ConditionalExpression
src/Roller.ts:41:14
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if(!(value >= 1 && value <= this._faces))
+        if(!(true))
         {
             return 0;
killedBy: Roller Tests Roll Test: The roll function should return 0 if a wrong value is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/Roller.ts:42:9
     //      of rolls for that face by 1
     roll(value: number): number{
         if(!(value >= 1 && value <= this._faces))
-        {
-            return 0;
-        }
+        {}
         else
         {
killedBy: Roller Tests Roll Test: The roll function should return 0 if a wrong value is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/Roller.ts:46:9
             return 0;
         }
         else
-        {
-            this._last = value;
-            this._distribution.set(value,this._distribution.get(value)+1)
-        }
+        {}
         return value;
     }
killedBy: Roller Tests Last roll Test : should return the last roll that's made.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/Roller.ts:48:42
         else
         {
             this._last = value;
-            this._distribution.set(value,this._distribution.get(value)+1)
+            this._distribution.set(value,this._distribution.get(value) - 1)
         }
         return value;
killedBy: Roller Tests Distribution test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] BlockStatement
src/Roller.ts:55:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        return this._last
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each
killedBy: Roller Tests Last roll Test : should return the last roll that's made.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined
